app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "salt", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["salt", "KhQNZT2DACJk1pKy38js"], ["crypted_password", "$2a$10$mm.78zIrcbemT1ks9xOSv.ojXQe/wuBS8BjFeJx15AP6FjdRdaili"], ["updated_at", "2016-06-20 12:15:30.068154"], ["id", 1]]